# 환경설정 보충

https://gist.github.com/allieus/b7ea5797459b47c91589c4253ad2b2b9

# data

아래 구조가 되도록, 압축을 풀어주세요.

+ `"c:\Users\계정명\data\titanic\train.csv"`
+ `"c:\Users\계정명\data\titanic\test.csv"`

# 3일차

## titanic 맛보기

In [1]:
import pandas as pd

train_df = pd.read_csv('data/titanic/train.csv', index_col='PassengerId')
print(train_df.shape)
train_df.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
test_df = pd.read_csv('data/titanic/test.csv', index_col='PassengerId')
print(test_df.shape)
test_df.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
train_df.Survived.mean()  # 전체 생존율

0.3838383838383838

In [4]:
mask = train_df.Sex == 'male'
train_df.loc[mask].Survived.mean()

0.18890814558058924

In [5]:
mask = train_df.Sex == 'female'
train_df.loc[mask].Survived.mean()

0.7420382165605095